# SQL CHEAT SHEET: SET THEORY CLAUSES
UNION | UNION ALL |

In [4]:
reload_ext sql

In [12]:
%%sql
postgresql://localhost/leaders

'Connected: @leaders'

In [15]:
%%sql
SELECT * FROM prime_ministers
LIMIT 1;

   postgresql://localhost/films
 * postgresql://localhost/leaders
1 rows affected.

[('Egypt', 'Africa', 'Sherif Ismail')]

In [16]:
%%sql
SELECT * FROM monarchs
LIMIT 1;

   postgresql://localhost/films
 * postgresql://localhost/leaders
1 rows affected.

[('Brunei', 'Asia', 'Hassanal Bolkiah')]

___

## 1. UNION
UNION includes items in both tables without double counting items in both tables!

In [23]:
%%sql
SELECT prime_minister AS leader, country FROM prime_ministers
UNION
SELECT monarch, country FROM monarchs
ORDER BY country
LIMIT 3;

   postgresql://localhost/films
 * postgresql://localhost/leaders
3 rows affected.

[('Malcolm Turnbull', 'Australia'),
 ('Hassanal Bolkiah', 'Brunei'),
 ('Sherif Ismail', 'Egypt')]

___

In [31]:
%%sql
postgresql://localhost/countries

'Connected: @countries'

- Combine tables economies2010 and economies2015 into one table

In [36]:
%%sql
SELECT * FROM economies2010
UNION
SELECT * FROM economies2015
ORDER BY code, year
LIMIT 6;

 * postgresql://localhost/countries
   postgresql://localhost/films
   postgresql://localhost/leaders
6 rows affected.

[('AFG', 2010, 'Low income', 37.133),
 ('AFG', 2015, 'Low income', 21.466),
 ('AGO', 2010, 'Upper middle income', 23.534),
 ('AGO', 2015, 'Upper middle income', -0.425),
 ('ALB', 2010, 'Upper middle income', 20.011),
 ('ALB', 2015, 'Upper middle income', 13.84)]

- Determine all (non-duplicated) country codes in either the cities or the currencies table. 
- The result should be a table with only one field called country_code.

In [44]:
%%sql
SELECT country_code FROM cities
UNION
SELECT code FROM currencies
ORDER BY country_code
LIMIT 1;

 * postgresql://localhost/countries
   postgresql://localhost/films
   postgresql://localhost/leaders
1 rows affected.

[('ABW',)]

___

## 2. UNION ALL
UNION ALL includes items in both tables and replicates items in both tables e.g the leaders of Brunei

In [47]:
%%sql
postgresql://localhost/leaders

'Connected: @leaders'

In [48]:
%%sql
SELECT prime_minister AS leader, country FROM prime_ministers
UNION ALL
SELECT monarch, country FROM monarchs
ORDER BY country
LIMIT 3;

   postgresql://localhost/countries
   postgresql://localhost/films
 * postgresql://localhost/leaders
3 rows affected.

[('Malcolm Turnbull', 'Australia'),
 ('Hassanal Bolkiah', 'Brunei'),
 ('Hassanal Bolkiah', 'Brunei')]

- Determine all combinations (include duplicates) of country code and year that exist in either the economies or the populations tables. Order by code then year.
- The result of the query should only have two columns/fields. Think about how many records this query should result in.
- You'll use code very similar to this in your next exercise after the video. Make note of this code after completing it.

In [54]:
%%sql
postgresql://localhost/countries

'Connected: @countries'

In [71]:
%%sql
SELECT code, year FROM economies
UNION ALL
SELECT country_code, year FROM populations
ORDER BY code, year
LIMIT 5;

 * postgresql://localhost/countries
   postgresql://localhost/films
   postgresql://localhost/leaders
5 rows affected.

[('ABW', 2010), ('ABW', 2015), ('AFG', 2010), ('AFG', 2010), ('AFG', 2015)]